# Pandas

Pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the Python programming language.

In [4]:
import pandas as pd

## Series
Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.). The axis labels are collectively referred to as the index. The basic method to create a Series is to call:

In [24]:
fruits = pd.Series(["apple", "pear", "orange", "melon", "kiwi"])
fruits

0     apple
1      pear
2    orange
3     melon
4      kiwi
dtype: object

In [12]:
fruits.apply(str.upper)

0     APPLE
1      PEAR
2    ORANGE
3     MELON
4      KIWI
dtype: object

In [11]:
numbers = pd.Series([5, 6, 3])
numbers * 2 + 1

0    11
1    13
2     7
dtype: int64

In [29]:
mask = numbers >= 5

In [30]:
numbers[mask]

0    5
1    6
dtype: int64

In [26]:
fruits[[True, True, False, False, True]]

0    apple
1     pear
4     kiwi
dtype: object

## DataFrame
DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects. It is generally the most commonly used pandas object.

In [32]:
data = {
    "Name": ["Anders", "Thomas", "Mario"],
    "Age": [42, 46, 36]
}

df = pd.DataFrame(data)
df

     Name  Age
0  Anders   42
1  Thomas   46
2   Mario   36

In [37]:
data = [
    {"Name": "Anders", "Age": 42},
    {"Name": "Thomas", "Age": 46},
    {"Name": "Mario", "Age": 36}
]

print(data)

df = pd.DataFrame(data)
df

[{'Name': 'Anders', 'Age': 42}, {'Name': 'Thomas', 'Age': 46}, {'Name': 'Mario', 'Age': 36}]

     Name  Age
0  Anders   42
1  Thomas   46
2   Mario   36

In [38]:
df["Name"]

0    Anders
1    Thomas
2     Mario
Name: Name, dtype: object

In [43]:
print(df["Age"] + 1)
print(df)
df["Age"] = df["Age"] + 1
df

0    43
1    47
2    37
Name: Age, dtype: int64
     Name  Age
0  Anders   42
1  Thomas   46
2   Mario   36

     Name  Age
0  Anders   43
1  Thomas   47
2   Mario   37

In [48]:
df["Age"] >= 45

0    False
1     True
2    False
Name: Age, dtype: bool

In [47]:
df[df["Age"] >= 45]

     Name  Age
1  Thomas   47

In [49]:
str(df)

'     Name  Age\n0  Anders   43\n1  Thomas   47\n2   Mario   37'